INSERT INTO study_room_board (study_room_id, study_room_member_id, title, content, created_date_time)
VALUES
(1, 1, '혼공자 스터디', '안녕하세요. 혼공자 모음~ 자유롭게 질문해주세요~!', '2024-05-31 19:00:00'),
(1, 1, '정처기 준비중', '자바 파면서 정보처리기사 준비.. 모두 파이팅입니다.', '2024-05-31 20:00:00'),
(1, 2, '자바 알고리즘 스터디', '같이 하실분??', '2024-06-01 19:00:00'),
(1, 2, '코테동', '모두가 코딩테스트 통과하는 그날까지 달려봅시다.', '2024-06-01 20:00:00'),
(1, 1, '자바 기초할 사람?', '함께할 말하는 감자들 구함', '2024-06-02 19:00:00'),
(1, 3, '한화 코테 준비', '한화시스템 코테 입사 관련한 취업 준비 스터디할 사람 일정 댓글로 지속적으로 공유하겠습니다.', '2024-06-02 20:00:00'),
(1, 3, '상속.. 어려움', '기초 안되어있는디.. 다시 공부해야겠지..?.', '2024-06-03 19:00:00'),
(1, 2, '프로그래밍 챌린지', '매주 월요일 새로운 프로그래밍 문제를 풀며, 실력을 쌓아가는 스터디 만듭니다. 코드 리뷰도 함께 합니다.', '2024-06-03 20:00:00'),
(1, 3, '독서 토론 모임', '자바 관련한 책 한 달에 한 권의 책을 읽고, 그에 대해 깊이 있게 토론하는 모임입니다. 과도한 친목은 금지입니다!', '2024-06-04 19:00:00'),
(1, 4, '말하는 감자 구출.. 제발..', '파이썬에서 넘어 와서 뭘해야 할지 막막해.. 조언 좀..', '2024-06-04 20:00:00')
(1, 4, '프로젝트 관리 마스터', 'PM으로 성장하기 위해서 개발 공부하는 사람들 있나?.', '2024-06-05 19:00:00'),
(1, 3, '학교 코딩 과제인데.. 몰루..', '어렵다 어려워..', '2024-06-05 20:00:00'),
(1, 3, '자바 가끔 이유 없이 오류남', '나만 그런줄 알았는데 친구들도 그러더라구 그래서 끄고 다시하면 됌 참고 ㄱㄱ', '2024-06-06 19:00:00'),
(1, 1, '고생했슈', '내일이면.. 안녕이다..', '2024-06-06 20:00:00'),
(1, 2, '이제 끝나네유', '다들 수고하셨습니다~!.', '2024-06-07 19:00:00'),
(2, 6, '프랑스어 마스터', '프랑스어를 마스터하기 위해 함께 공부하는 스터디입니다. 각자 학습한 내용을 공유합니다.', '2024-05-31 19:00:00'),
(2, 7, '코딩테스트 준비방', '하반기 입사 지원 예정인 사람들을 위한 스터디입니다.', '2024-06-01 19:00:00'),
(2, 8, '지적직 공무원 준비', '지적직 공무원 준비 스터디입니다. 함께 열심히 해봐요!', '2024-06-02 19:00:00'),
(2, 9, '서울여대 사회복지학과 19학번', '함께 공부해유~!', '2024-06-03 19:00:00'),
(2, 10, '디지털 마케팅 전문가', '디지털 마케팅의 다양한 전략과 실무를 배우고 실습하는 스터디입니다.', '2024-06-04 19:00:00'),
(2, 6, '건강한 라이프 스타일', '건강한 식습관과 운동법을 배우고, 실천하는 스터디입니다.', '2024-06-05 19:00:00'),
(2, 7, '창업 준비반', '창업을 준비하며 아이디어를 구체화하고, 사업 계획을 작성하는 스터디입니다.', '2024-06-06 19:00:00'),
(2, 8, '패션 디자인 도전', '패션 디자인에 관심 있는 사람들을 위한 스터디입니다. 디자인을 배우고, 작품을 만들고 공유합니다.', '2024-06-07 19:00:00'),
(2, 9, '스페인어 마스터', '스페인어를 배우고, 회화 실력을 기르기 위한 스터디입니다.', '2024-06-08 19:00:00'),
(2, 10, '사진 촬영 기법', '사진 촬영 기술을 배우고, 함께 출사 나가서 실습하는 스터디입니다.', '2024-06-09 19:00:00'),
(2, 6, '건축 설계 실습', '건축 설계 이론을 배우고, 실제 설계 프로젝트를 진행하는 스터디입니다.', '2024-06-10 19:00:00'),
(2, 7, '인공지능 연구', '인공지능의 이론과 실제를 연구하고, 프로젝트를 진행하는 스터디입니다.', '2024-06-11 19:00:00'),
(2, 8, '고등학교 수학 완전정복', '고등학교 수학 문제를 완전히 정복하기 위한 스터디입니다.', '2024-06-12 19:00:00'),
(2, 9, '역사 토론 모임', '역사적인 사건과 인물에 대해 깊이 있는 토론을 진행하는 모임입니다.', '2024-06-13 19:00:00'),
(2, 9, '9급 공무원 최종 도전', '마지막으로 도전하는 9급 공무원 시험 준비를 위한 스터디입니다.', '2024-06-13 20:00:00');

SELECT * FROM study_room_board;

DROP TABLE study_room_board;