INSERT INTO study_room_board (study_room_id, study_room_member_id, title, content, created_date_time)
VALUES
(1, 1, '혼공자 스터디', '안녕하세요. 혼공자 모음~ 자유롭게 질문해주세요~!', '2024-05-30 19:30:00'),
(1, 1, '정처기 준비중', '자바 파면서 정보처리기사 준비.. 모두 파이팅입니다.', '2024-05-30 20:05:00'),
(1, 2, '자바 알고리즘 스터디', '같이 하실분??', '2024-05-30 21:01:00'),
(1, 2, '코테동', '모두가 코딩테스트 통과하는 그날까지 달려봅시다.', '2024-06-01 10:23:00'),
(1, 1, '자바 기초할 사람?', '함께할 말하는 감자들 구함', '2024-06-01 10:50:00'),
(1, 3, '한화 코테 준비', '한화시스템 코테 입사 관련한 취업 준비 스터디할 사람 일정 댓글로 지속적으로 공유하겠습니다.', '2024-06-01 11:00:00'),
(1, 3, '상속.. 어려움', '기초 안되어있는디.. 다시 공부해야겠지..?.', '2024-06-01 13:40:00'),
(1, 2, '프로그래밍 챌린지', '매주 월요일 새로운 프로그래밍 문제를 풀며, 실력을 쌓아가는 스터디 만듭니다. 코드 리뷰도 함께 합니다.', '2024-06-01 15:15:00'),
(1, 3, '독서 토론 모임', '자바 관련한 책 한 달에 한 권의 책을 읽고, 그에 대해 깊이 있게 토론하는 모임입니다. 과도한 친목은 금지입니다!', '2024-06-02 09:30:00'),
(1, 4, '말하는 감자 구출.. 제발..', '파이썬에서 넘어 와서 뭘해야 할지 막막해.. 조언 좀..', '2024-06-02 10:01:00')
(1, 4, '프로젝트 관리 마스터', 'PM으로 성장하기 위해서 개발 공부하는 사람들 있나?.', '2024-06-03 10:45:00'),
(1, 3, '학교 코딩 과제인데.. 몰루..', '어렵다 어려워..', '2024-06-04 10:00:00'),
(1, 3, '자바 가끔 이유 없이 오류남', '나만 그런줄 알았는데 친구들도 그러더라구 그래서 끄고 다시하면 됌 참고 ㄱㄱ', '2024-06-05 10:15:00'),
(1, 1, '고생했슈', '내일이면.. 안녕이다..', '2024-06-13 01:30:00'),
(1, 2, '이제 끝나네유', '다들 수고하셨습니다~!.', '2024-06-14 04:45:00'),
(2, 5, '파이썬 마스터', '파이썬를 마스터하기 위해 함께 공부하는 스터디 구합니다. 각자 학습한 내용을 공유합니다.', '2024-05-31 12:00:00'),
(2, 7, '코딩테스트 준비방', '하반기 입사 지원 예정인 사람들을 위한 스터디 할 사람??', '2024-05-31 13:15:00'),
(2, 6, '왕감자 파이썬으로 도전', '비전공자에서 넘어왔습니다~ 함께 열심히 해봐요!', '2024-05-31 15:30:00'),
(2, 8, '파이썬 알고리즘 모음', '함께 공부해유~!', '2024-06-01 11:45:00'),
(2, 8, '파이썬 과제', '도와주실분.. 젭알..', '2024-06-02 17:00:00'),
(2, 8, '챗 GPT', '나만 안됌?', '2024-06-03 12:15:00'),
(2, 9, '파이썬 좋다', '자바에서 넘어왔는데 진짜.. 좋네..ㅎ', '2024-06-04 12:30:00'),
(2, 7, '자바로 넘어가실분..?', '코테 보러갔는데 파이썬이 없다..', '2024-06-06 12:45:00'),
(2, 5, '코테 후기', '안녕하세요. 말하는 감자입니다...', '2024-06-07 13:00:00'),
(2, 6, '공부할꺼 넘 많아..', '자바에서 처음 넘어 왔는데 이 친구도.. 공부가 필요하네.. 알고리즘..', '2024-06-09 13:15:00'),
(2, 7, '다들 잘하고 있는가?', '다들 화이팅이야', '2024-06-10 13:30:00'),
(2, 8, '뭐지...', '자바로 넘어가야하나...', '2024-06-16 13:45:00'),
(2, 5, '알고리즘', '같이 분석할 사람?', '2024-06-18 14:00:00'),
(2, 5, '내일 끝나네..', '수고 했어요~!', '2024-06-20 14:15:00'),
(2, 4, '파이썬 마스터', '다들 고생 많았다잉~!', '2024-06-21 01:30:00')
;

SELECT * FROM study_room_board;

DROP TABLE study_room_board;